app/controllers/courses_controller.rb

INSERT INTO "courses" ("number", "title", "semester", "category", "cataloglink", "evaluationlink", "recenttakers", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        #render plain: params[:course].inspect
        # @course = Course.new(params[:course])
        @course = Course.new(course_params)

        if @course.save